Revit 2026 API

# LoadedFamilyIntegrityCheck Class

---

Functions for checking the integrity of loaded families.

SystemObject Autodesk.Revit.DBLoadedFamilyIntegrityCheck

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class LoadedFamilyIntegrityCheck
```
```vb
Public NotInheritable Class LoadedFamilyIntegrityCheck
```
```cpp
public ref class LoadedFamilyIntegrityCheck abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type LoadedFamilyIntegrityCheck = class end
```

The LoadedFamilyIntegrityCheck type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CheckAllFamilies |  |
|  | CheckAllFamiliesSlow |  |
|  | CheckFamily | Check that the loaded family has its content document. |

#### Reference

Autodesk.Revit.DB Namespace